Repository: 1Mgtrn3/Zigbee2TelegramQueueBot
Catalog: Zigbee2TelegramQueueBot/Resources/Services.Helpers.Localization.LocalizationHelper.*.resx
Languages: ru

# AddMoreTimeInTheQueueMenuCommands
source: \r\nAvailable commands:\r\n/cancel
ru: \r\nДоступные команды:\r\n/cancel

# AddMoreTimeInTheQueueMenuText
source: Enter the number of minutes you want to add and tap SEND.
ru: Введите сколько вам нужно дополнительного времени и отправьте сообщение

# AddMoreTimeInTheRoomMenuCommands
source: \r\nAvailable commands:\r\n/cancel
ru: \r\nДоступные команды:\r\n/cancel

# AddMoreTimeInTheRoomMenuText
source: Enter the number of minutes you want to add and tap SEND.
ru: Введите сколько вам нужно дополнительного времени и отправьте сообщение

# CommandNotRecognized
source: Command wasn't recognized. Please try again.
ru: Команда не распознана, повторите снова

# doorIsLockedInstruction
source: Add yourself some time to cover both the person in the room and yourself.
ru: Добавьте себе времени, чтобы хватило и вам и человеку внутри.

# DoorIsLockedMenuCommands
source: \r\nAvailable commands:\r\n
ru: \r\nДоступные команды:\r\n

# EnqueueAlert
source: You are in the queue. Your position in the queue: [QUEUEPOS], approximate time to wait: [WAITTIME] minutes
ru: Вы добавлены в очередь. Ваша порядковый номер в очереди - [QUEUEPOS], время ожидания [WAITTIME] минут.

# InactivityDequeueAlert
source: You were dequeued due to inactivity. Please try again if you still have the need.
ru: Вы были исключены из очереди. Попробуйте когда у вас будет время.

# InBetweenQueueAndRoomMenuCommands
source: \r\nAvailable commands:\r\n/startsession\r\n/skip\r\n/dequeue\r\n/doorislocked
ru: \r\nДоступные команды\r\n/startsession\r\n/skip\r\n/dequeue\r\n/doorislocked

# InBetweenQueueAndRoomMenuText
source: The door is open and it's your turn.
ru: Дверь открылась, сейчас ваша очередь идти.

# MainMenuCommands
source: \r\nAvailable commands:\r\n/status\r\n/enqueue
ru: \r\nДоступные команды:\r\n/status\r\n/enqueue

# MainMenuText
source: Main menu. You can get the room's status or enqueue
ru: Главное меню. Узнайте статус или займите очередь.

# NumberNotParsed
source: You have entered an invalid value. Please enter a number.
ru: Вы задали неверное значение. Пожалуйста введите число

# NumberOverLimit
source: The value you've entered is over the limit. Please try again.
ru: Вы задали значение больше лимита. Пожалуйста повторите ввод

# OrderChangeAlert
source: Your new position in the queue is [QUEUEPOS]. Approximate time to wait: [WAITTIME] minutes
ru: Новое место в очереди: [QUEUEPOS]. Новое время ожидания [WAITTIME] минут

# QueueMenuCommands
source: \r\nAvailable commands:\r\n/cancelenqueue\r\n/skip\r\n/needmoretime
ru: \r\nДоступные команды:\r\n/cancelenqueue\r\n/skip\r\n/needmoretime

# QueueMenuText
source: You are in the queue. You can leave the queue or pass your turn to the person after you. If there's noone after you, you would leave the queue automatically.
ru: Вы в очереди. Вы можете выйти из очереди либо пропустить человека после вас вперед. Если после вас никого нет, то вместо пропуска вы выйдете из очереди.

# RoomMenuCommands
source: \r\nAvailable commands:\r\n/free\r\n/needmoretime\r\n/doorislocked
ru: \r\nДоступные команды:\r\n/free\r\n/needmoretime\r\n/doorislocked

# RoomMenuText
source: You have occupied the room. If it is not you who's in the room, press DOOR IS LOCKED. If you need more time than expected and you want to notify the others, press NEED MORE TIME.
ru: Вы заняли комнату. Если комнату заняли не вы, нажмите на кнопку ДВЕРЬ ЗАКРЫТА. Если вам нужно больше времени чем вы указали и вы хотите уведомить об этом остальную очередь нажмите НУЖНО БОЛЬШЕ ВРЕМЕНИ

# SimpleMainMenuText
source: Main menu. You can check the status or subscribe to the changes of the status.
ru: Главное меню. Узнайте статус или подпишитесь на статусы.

# SimpleStatusMenuText
source: The room is [ROOMSTATUS]. People subscribed: [SUBCOUNT]
ru: Комната [ROOMSTATUS]. Подписано на уведомления: [SUBCOUNT] человек

# SimpleSubscribedMenuText
source: You are subscribed to the notifications. Press EXIT to unsubscribe.
ru: Вы подписаны на уведомления. Нажмите ВЫХОД чтобы отписаться

# SkipFirstAlert
source: Your new position in the queue is [QUEUEPOS]. Approximate time to wait: [WAITTIME] minutes
ru: Ваша новая позиция в очереди [QUEUEPOS]. Ожидаемое время [WAITTIME] минут.

# SkipOtherAlert
source: Your new position in the queue is [QUEUEPOS]. Approximate time to wait: [WAITTIME] minutes
ru: Ваша новая позиция в очереди [QUEUEPOS]. Ожидаемое время [WAITTIME] минут.

# StatusFreeMenuCommands
source: \r\nAvailable commands:\r\n/occupy\r\n/exit
ru: \r\nДоступные команды:\r\n/occupy\r\n/exit

# StatusFreeMenuText
source: The room is free
ru: Комната свободна.

# StatusOccupiedMenuCommands
source: \r\nAvailable commands:\r\n/enqueue\r\n/exit
ru: \r\nДоступные команды:\r\n/enqueue\r\n/exit

# StatusOccupiedMenuText
source: The room is occupied. [QUEUESIZE] people currently in queue, approximate wait time [WAITMINUTES]
ru: Комната занята. В очереди [QUEUESIZE] человек, время ожидания на данный момент примерно [WAITMINUTES]

# VisitDurationCustomMenuCommands
source: \r\nAvailable commands:\r\n/exit
ru: \r\nДоступные команды:\r\n/exit

# VisitDurationCustomMenuText
source: Enter the number of minutes you expect to remain in the room and tap SEND
ru: Введите количество минут и отправьте сообщение

# VisitDurationMenuCommands
source: \r\nAvailable commands:\r\n/5minutes\r\n/10minutes\r\n/15minutes\r\n/custom\r\n/exit
ru: \r\nДоступные команды:\r\n/5minutes\r\n/10minutes\r\n/15minutes\r\n/custom\r\n/exit

# VisitDurationMenuText
source: Enter your approximate room occupation time. This will let the others know when they would get into the room. You are NOT limited by this time limit.
ru: Выберете примерное время нахождения в комнате. Это поможет остальным понять сколько им ждать. Вы НЕ ограничены этим временем.
